eisup_2019_docmng_integration/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Распределять</name>
      <description>Распределять</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала проекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания проекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПроектаКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Case</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Доходный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОснованиеПроекта</name>
    <type>
      <types>CatalogRef.абс_ОснованияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПрефиксКодовПроектов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_РуководительПроекта</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТекущийЭтап</name>
    <type>
      <types>CatalogRef.абс_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДоходныйПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПлановаяДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Портфель</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Комиссия</name>
    <type>
      <types>CatalogRef.КомиссияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеТребуетсяСогласованиеРПвЗЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_Заказы</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ВнутренниеЛимиты</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КВиТЗ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ЭтапыПроектов</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.абс_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_НастройкиОбменаСSQL/абс_НастройкиОбменаСSQL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_НастройкиОбменаСSQL</name>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>(Строка типа &quot;Справочник.Контрагенты&quot;)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыДанныхSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТаблицыSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.абс_ОбменSQL</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерезаписыватьНайденные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьГруппыСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбменЧерезВерсионностьОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СложныйЗапрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_Исключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыДляОбмена</name>
    <attributes>
      <name>ИмяРеквизитаВSQL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДаннымРеквизита</name>
      <comment>( пример: регистрируем Спр.Контрагенты, и надо чтобы сохранялся код реквизита ссылочного типа, то пишем. &quot;НашРеквизит.Код&quot;) можно даже писать условия</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДаннымРеквизитаСУсловием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьПоРеквизиту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьОбмен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизитаВSQL</name>
      <comment>&quot;строка&quot;/&quot;число&quot;/ &quot;логическое&quot; (0,1)/Дата, ДатаИВремя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитГруппы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ttk_МодульПолученияДанныхРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ttk_ОбязательноНепустой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/Проекты/ObjectModule.bsl
Перем ПрошлыйИзмененныйРодительОбъектаДоступа;

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		//абс Родин 39895 240414
		Если Не ЗначениеЗаполнено(абс_Организация) Тогда
			Сообщить("Необходимо заполнить организацию!");
			Отказ = Истина;			
		КонецЕсли;
		//абс Родин 39895 240414
	
	ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
		
		//АБС НАЧАЛО Задача №08759
		Если НЕ Отказ И ЭтоГруппа И абс_Case Тогда
			
			СписокГрупп = Новый СписокЗначений;
			ПолучитьВсехРодителейПроекта(Ссылка, СписокГрупп);
			Для Каждого с Из СписокГрупп Цикл
				
				Если с.Значение.абс_Case Тогда 
					Сообщить("Нельзя установить признак! Признак уже установлен по группе: "+с.Значение.Наименование);
					Отказ = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;	
		//\\АБС КОНЕЦ Задача №08759
		
		// АБС. Проектный учет
		//Если Не ЭтоНовый() Тогда 
		//	абс_ЗаказПокупателя = Документы.ЗаказПокупателя.НайтиПоРеквизиту("Проект", Ссылка);
		//КонецЕсли;
		//\\АБС
		
		//АБС_Стрельцов+ добавлено: 15.11.2012
		//------------------------------------
		//Если абс_Организация = Справочники.Организации.ПустаяСсылка() Тогда
		//	Сообщить("Не заполнена Организация !", СтатусСообщения.Важное);
		//	Отказ = Истина;
		//КонецЕсли;
		//------------------------------------
		//АБС_Стрельцов-
		
		//АБС_Стрельцов+ добавлено: 10.12.2012
		//проверка ТЧ "Заказы" на наличие дублей значений "Организация"
		//------------------------------------
		РезультатПроверки = абс_ПроектныйУчет.ПроверитьТабличнуюЧастьЗаказыНаДублиОрганизаций(абс_Заказы.Выгрузить());
		Если РезультатПроверки.Свойство("ЕстьДубли") И РезультатПроверки.ЕстьДубли Тогда
			Сообщить("Невозможно записать данный элемент! В табличной части ""Заказы"" существует дублирование организации: """+Строка(РезультатПроверки.Организация)+""" !", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		//------------------------------------
		//АБС_Стрельцов-

		//АБС ВСТАВКА 10.04.2014 Навценя
		ДополнительныеСвойства.Вставить("ИнтеграцияLotus_ПредыдущееСостояние", ИнтеграцияLotus_ПолучитьПредыдущиеРеквизиты()); 
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый()); 
		//АБС ВСТАВКА  КОНЕЦ
		
	КонецЕсли;
	
КонецПроцедуры

//АБС НАЧАЛО Задача №08759
Процедура ПолучитьВсехРодителейПроекта(ТекущийПроект, СписокГрупп) Экспорт //абс_Стрельцов+ добавлено: 25.09.2012
	
	РодительПроекта = ТекущийПроект.Родитель;
	Если РодительПроекта.Пустая() Тогда
		Возврат;
	Иначе
		СписокГрупп.Добавить(РодительПроекта);
		ПолучитьВсехРодителейПроекта(РодительПроекта, СписокГрупп)
	КонецЕсли;	                      
	
КонецПроцедуры
//\\АБС КОНЕЦ Задача №08759

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		НастройкаПравДоступа.ОбновитьПраваДоступаКИерархическимОбъектамПриНеобходимости(Ссылка,ПрошлыйИзмененныйРодительОбъектаДоступа, Отказ);
		
		//АБС ВСТАВКА 10.04.2014 Навценя
		ИнтеграцияLotus_ЗарегистрироватьИзменения(Отказ);
		//АБС ВСТАВКА  КОНЕЦ
		//АБС ВСТАВКА 47329  29.09.2014 13:41:47  Шамов
		Если ЗначениеЗаполнено(КодПроектаКомпании) Тогда
			ПроверитьКодТитула(Отказ);
		КонецЕсли;
		//АБС ВСТАВКА 47329 КОНЕЦ
	
	КонецЕсли;
	// АБС. Проектный учет
	//СоздатьЗаказПокупателя(Отказ);
	//\\АБС
	
КонецПроцедуры

// АБС. Проектный учет
Процедура СоздатьЗаказПокупателя(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(абс_ЗаказПокупателя) Тогда
		
		//АБС_Стрельцов+ добавлено: 15.11.2012
		//---------------------------------------
		Если абс_ЗаказПокупателя.Организация = Справочники.Организации.ПустаяСсылка() Тогда
			//Сообщить("Невозможно выбрать документ Заказ Покупателя, у которого пустая Организация !", СтатусСообщения.Важное);
			//Отказ = Истина;
			ЗаказПокупателяОбъект = абс_ЗаказПокупателя.ПолучитьОбъект();
			ЗаказПокупателяОбъект.Организация = абс_Организация;
			Попытка
				ЗаказПокупателяОбъект.Записать();
			Исключение
				Сообщить("Невозможно было установить организацию для выбранного документа Заказ Покупателя по причине: "+ОписаниеОшибки(), СтатусСообщения.Внимание);
			КонецПопытки;
		КонецЕсли;
		//---------------------------------------
		//АБС_Стрельцов-
		
		Возврат;
	КонецЕсли;
	ЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент();
	ЗаказПокупателя.Дата = НачалоГода(ТекущаяДата());
	ЗаказПокупателя.Организация = абс_Организация;
	ЗаказПокупателя.Ответственный = Ответственный;
	ЗаказПокупателя.Проект = Ссылка;
	Попытка
		ЗаказПокупателя.Записать(РежимЗаписиДокумента.Запись);
		абс_ЗаказПокупателя = ЗаказПокупателя.Ссылка;
		Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры
//\\АБС


//АБС ВСТАВКА 10.04.2014 Навценя
Функция ИнтеграцияLotus_ПолучитьПредыдущиеРеквизиты()
	
	СтруктураРеквизитов = Новый Структура;
	
	Если ЭтоНовый() Тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Проекты.Родитель,
	                      |	Проекты.Наименование,
	                      |	Проекты.ДатаНачала,
	                      |	Проекты.ДатаОкончания,
	                      |	Проекты.Ответственный,
	                      |	Проекты.Описание,
	                      |	Проекты.КодПроектаКомпании,
	                      |	Проекты.Закрыт,
	                      |	Проекты.абс_Статус,
	                      |	Проекты.абс_Case,
	                      |	Проекты.абс_Организация,
	                      |	Проекты.абс_Доходный,
	                      |	Проекты.абс_ОснованиеПроекта,
	                      |	Проекты.абс_РуководительПроекта,
	                      |	Проекты.абс_ТЭО,
	                      |	Проекты.абс_ВидПроекта,
	                      |	Проекты.абс_Портфель
	                      |ИЗ
	                      |	Справочник.Проекты КАК Проекты
	                      |ГДЕ
	                      |	Проекты.Ссылка = &Ссылка");
						  
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Для Каждого Колонка из Результат.Колонки Цикл 
		СтруктураРеквизитов.Вставить(Колонка.Имя);	
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 	
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Процедура ИнтеграцияLotus_ЗарегистрироватьИзменения(Отказ)
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда 
		Возврат;
	КонецЕсли;
		
	Если НЕ ДополнительныеСвойства.Свойство("ИнтеграцияLotus_ПредыдущееСостояние") Тогда 
		Возврат;		
	КонецЕсли;
	
	Узел = Справочники.абс_НастройкиОбменаСSQL.ИнтеграцияLotus_ПолучитьУзелПроекты();
	
	Если НЕ ЗначениеЗаполнено(Узел) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда  
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
		Возврат;
	КонецЕсли;
	
	Для Каждого реквизит из ДополнительныеСвойства.ИнтеграцияLotus_ПредыдущееСостояние Цикл  
		Если реквизит.значение <> ЭтотОбъект[реквизит.ключ] Тогда 
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
			Прервать;
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры
//АБС ВСТАВКА  КОНЕЦ

//АБС ВСТАВКА 47329  29.09.2014 13:41:47  Шамов
Процедура ПроверитьКодТитула(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Проекты.Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка <> &Ссылка
		|	И Проекты.КодПроектаКомпании = &КодПроектаКомпании";

	Запрос.УстановитьПараметр("КодПроектаКомпании", КодПроектаКомпании);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();
   	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		Сообщить("В базе уже существует проект с кодом проекта компании """ + КодПроектаКомпании + """");
	КонецЕсли;
	
КонецПроцедуры
//АБС ВСТАВКА 47329 КОНЕЦ
